In [1]:
import pandas as pd
import numpy as np
from tensorflow import keras

In [2]:
path='drive/MyDrive/mch/'

In [3]:
data3=pd.read_csv(path+'03_low.csv')
data4=pd.read_csv(path+'04_low.csv')
data5=pd.read_csv(path+'05_low.csv')

In [6]:
a=data3.gps

In [15]:
mn1, mn2= 1e9,1e9
mx1,mx2=0,0
for i in a:
  b=list(map(float,i[1:-1].split(', ')))
  if b[0]<mn1:
    mn1=b[0]
  if b[1]<mn2:
    mn2=b[1]
  if b[0]>mx1:
    mx1=b[0]
  if b[1]>mx2:
    mx2=b[1]

In [16]:
mn1, mn2,

(55.655155181884766, 37.49541473388672, 55.753211975097656, 37.75920104980469)

In [10]:
(37.75920104980469-37.49541473388672)/35

0.007536751883370536

In [19]:
data=pd.concat([data3,data4,data5])
data.date=pd.to_datetime(data.date)
data=data.drop(['Unnamed: 0'],axis=1)

In [30]:
data['DayOfWeek']=data.date.dt.dayofweek

In [2]:
data=pd.read_csv('data_prep_coords.csv')
data=data.drop(['Unnamed: 0'], axis=1)

In [4]:
data=data.drop(['Unnamed: 0'], axis=1)

In [44]:
DoW_Data=((data.groupby(['DayOfWeek', 'gps'])['people'].sum())/92).reset_index()
weekend=(DoW_Data[DoW_Data['DayOfWeek']>=5].groupby(['gps']).sum()/2).reset_index()
working_day=(DoW_Data[DoW_Data['DayOfWeek']<5].groupby(['gps']).sum()/5).reset_index()

In [62]:
longs=np.linspace(mn2,mx2,60)
lats=np.linspace(mn1,mx1,60)
data['lats']=np.zeros(data.shape[0])
data['longs']=np.zeros(data.shape[0])

In [80]:
latts=[]
longgs=[]
for i in range(data.shape[0]):
  aaa=list(map(float,data.iloc[i].gps[1:-1].split(', ')))
  lat=aaa[0]
  lon=aaa[1]
  latts.append(lat)
  longgs.append(lon)

In [85]:
latss=np.array(latts)
longss=np.array(longgs)

In [86]:
data['lat']=latss
data['long']=longss

In [89]:
data.to_csv('data_prep_coords.csv')

In [78]:
data=pd.read_csv('data_prep_coords.csv')
data=data.drop(['Unnamed: 0'], axis=1)

        hour       date  ... DayOfWeek  lats
0          0 2021-03-01  ...         0   0.0
1          0 2021-03-01  ...         0   0.0
2          0 2021-03-01  ...         0   0.0
3          0 2021-03-01  ...         0   0.0
4          0 2021-03-01  ...         0   0.0
...      ...        ...  ...       ...   ...
982870    23 2021-05-31  ...         0   0.0
982871    23 2021-05-31  ...         0   0.0
982872    23 2021-05-31  ...         0   0.0
982873    23 2021-05-31  ...         0   0.0
982874    23 2021-05-31  ...         0   0.0

[2896354 rows x 6 columns]

In [5]:
data.head()

   hour        date  ...        lat       long
0     0  2021-03-01  ...  55.655155  37.757648
1     0  2021-03-01  ...  55.655540  37.758636
2     0  2021-03-01  ...  55.656940  37.759197
3     0  2021-03-01  ...  55.657356  37.758579
4     0  2021-03-01  ...  55.672806  37.495415

[5 rows x 9 columns]

In [16]:
data.groupby(pd.cut(data["lat"], np.arange(55.655155, 55.753211975097656+0.0028016226632254465, 0.0028016226632254465)))['people'].mean()

lat
(55.655, 55.658]    20.281097
(55.658, 55.661]          NaN
(55.661, 55.664]          NaN
(55.664, 55.666]          NaN
(55.666, 55.669]          NaN
(55.669, 55.672]          NaN
(55.672, 55.675]    29.750497
(55.675, 55.678]          NaN
(55.678, 55.68]           NaN
(55.68, 55.683]           NaN
(55.683, 55.686]          NaN
(55.686, 55.689]          NaN
(55.689, 55.692]          NaN
(55.692, 55.694]          NaN
(55.694, 55.697]          NaN
(55.697, 55.7]            NaN
(55.7, 55.703]            NaN
(55.703, 55.706]    60.540161
(55.706, 55.708]    61.228167
(55.708, 55.711]    68.430895
(55.711, 55.714]    57.397207
(55.714, 55.717]    46.507170
(55.717, 55.72]     61.100693
(55.72, 55.722]     61.114706
(55.722, 55.725]    55.436001
(55.725, 55.728]    75.785035
(55.728, 55.731]    84.872276
(55.731, 55.734]    62.691917
(55.734, 55.736]    60.830259
(55.736, 55.739]    65.476755
(55.739, 55.742]    62.365836
(55.742, 55.745]    67.586489
(55.745, 55.748]    66.405913
(55.748, 55.75]     77.605995
(55.75, 55.753]     91.259967
(55.753, 55.756]    21.679817
Name: people, dtype: float64

In [29]:
data_agg=data.groupby([pd.cut(data["lat"], np.arange(55.655155, 55.753211975097656+0.0028016226632254465, 0.0028016226632254465)),pd.cut(data["long"], np.arange(37.49541473388672, 37.75920104980469+0.007536751883370536, 0.007536751883370536)), 'DayOfWeek', 'hour'])['people'].mean().reset_index()

In [35]:
np.argmax(data_agg.people)

129026

In [41]:
data_agg[data_agg['DayOfWeek']<5].groupby(['lat','long'])['people'].mean().reset_index()

                   lat              long  people
0     (55.655, 55.658]  (37.495, 37.503]     0.0
1     (55.655, 55.658]   (37.503, 37.51]     0.0
2     (55.655, 55.658]   (37.51, 37.518]     0.0
3     (55.655, 55.658]  (37.518, 37.526]     0.0
4     (55.655, 55.658]  (37.526, 37.533]     0.0
...                ...               ...     ...
1291  (55.753, 55.756]  (37.729, 37.737]     0.0
1292  (55.753, 55.756]  (37.737, 37.744]     0.0
1293  (55.753, 55.756]  (37.744, 37.752]     0.0
1294  (55.753, 55.756]  (37.752, 37.759]     0.0
1295  (55.753, 55.756]  (37.759, 37.767]     0.0

[1296 rows x 3 columns]

In [40]:
weekend_features=data_agg[data_agg['DayOfWeek']>=5].groupby(['lat','long'])['people'].mean().reset_index()
workday_features=data_agg[data_agg['DayOfWeek']<5].groupby(['lat','long'])['people'].mean().reset_index()

In [44]:
workday_features.iloc[np.argmax(workday_features.people)]

lat       (55.714, 55.717]
long      (37.586, 37.593]
people             289.123
Name: 768, dtype: object

In [47]:
df_utro=data_agg['hour']>=6
df_vech=data_agg['hour']<=23

In [51]:
data_den=data_agg[df_utro & df_vech].groupby(['lat','long'])['people'].mean().reset_index()
data_noch=data_agg[~df_utro | ~df_vech].groupby(['lat','long'])['people'].mean().reset_index()

In [56]:
sum(data_den.people)-sum(data_noch.people)

-292.92402377987673

In [58]:
data_den

                   lat              long  people
0     (55.655, 55.658]  (37.495, 37.503]     0.0
1     (55.655, 55.658]   (37.503, 37.51]     0.0
2     (55.655, 55.658]   (37.51, 37.518]     0.0
3     (55.655, 55.658]  (37.518, 37.526]     0.0
4     (55.655, 55.658]  (37.526, 37.533]     0.0
...                ...               ...     ...
1291  (55.753, 55.756]  (37.729, 37.737]     0.0
1292  (55.753, 55.756]  (37.737, 37.744]     0.0
1293  (55.753, 55.756]  (37.744, 37.752]     0.0
1294  (55.753, 55.756]  (37.752, 37.759]     0.0
1295  (55.753, 55.756]  (37.759, 37.767]     0.0

[1296 rows x 3 columns]

In [59]:
data_noch

                   lat              long  people
0     (55.655, 55.658]  (37.495, 37.503]     0.0
1     (55.655, 55.658]   (37.503, 37.51]     0.0
2     (55.655, 55.658]   (37.51, 37.518]     0.0
3     (55.655, 55.658]  (37.518, 37.526]     0.0
4     (55.655, 55.658]  (37.526, 37.533]     0.0
...                ...               ...     ...
1291  (55.753, 55.756]  (37.729, 37.737]     0.0
1292  (55.753, 55.756]  (37.737, 37.744]     0.0
1293  (55.753, 55.756]  (37.744, 37.752]     0.0
1294  (55.753, 55.756]  (37.752, 37.759]     0.0
1295  (55.753, 55.756]  (37.759, 37.767]     0.0

[1296 rows x 3 columns]

In [64]:
data_fin_traffic=data_agg.groupby(['lat','long'])['people'].mean().reset_index()
data_fin_traffic['weekend_mean']=weekend_features['people']
data_fin_traffic['workdays_mean']=workday_features['people']
data_fin_traffic['day_mean']=data_den['people']
data_fin_traffic['night_mean']=data_noch['people']

In [73]:
data_fin_traffic.to_csv('data_extracted.csv')